
const QuestionData = [

  // Категория 0
  [
    {name:'Категория 0', id:0},

    // Вопрос 0
    {
      id: 0,
      question: 'Категория 0 - Вопрос 0',
      answer: 'Категория 0 - Ответ 0'
    },

    // Вопрос 1
    {
      id: 1,
      question: 'Категория 0 - Вопрос 1',
      answer: 'Категория 0 - Ответ 1'
    },

    // Вопрос 2
    {
      id: 2,
      question: 'Категория 0 - Вопрос 2',
      answer: 'Категория 0 - Ответ 2'
    },

  ],

  // Категория 1
  [
    {name:'Категория 1', id:1},

    // Вопрос 0
    {
      id: 0,
      question: 'Категория 1 - Вопрос 0',
      answer: 'Категория 1 - Ответ 0'
    },

    // Вопрос 1
    {
      id: 1,
      question: 'Категория 1 - Вопрос 1',
      answer: 'Категория 1 - Ответ 1'
    },

    // Вопрос 2
    {
      id: 2,
      question: 'Категория 1 - Вопрос 2',
      answer: 'Категория 1 - Ответ 2'
    },

  ],

  // Категория 2
  [
    {name:'Категория 2', id:2},


    // Вопрос 0
    {
      id: 0,
      question: 'Категория 2 - Вопрос 0',
      answer: 'Категория 2 - Ответ 0'
    },

    // Вопрос 1
    {
      id: 1,
      question: 'Категория 2 - Вопрос 1',
      answer: 'Категория 2 - Ответ 1'
    },

    // Вопрос 2
    {
      id: 2,
      question: 'Категория 2 - Вопрос 2',
      answer: 'Категория 2 - Ответ 2'
    },

  ]

];

export default QuestionData;
